Revit 2027 API
IFCData.CreateIFCAnyHandle Method
 Creates an IFCAnyHandle data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateIFCAnyHandle(
	IFCAnyHandle value
)
Public Shared Function CreateIFCAnyHandle (
	value As IFCAnyHandle
) As IFCData
public:
static IFCData^ CreateIFCAnyHandle(
	IFCAnyHandle^ value
)
static member CreateIFCAnyHandle :
        value : IFCAnyHandle -> IFCData
Parameters
value IFCAnyHandle
 The IFCAnyHandle value.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace